Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.4.74/samv71b/edc/ATSAMV71Q20B.PIC
      <edc:SFRDef edc:_addr="0x40038644" edc:access="--------------ww-w-w----wwwwwwww" edc:cname="USBHS_HSTPIPIDR9" edc:impl="0x350FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINEC" edc:desc="Received IN Data Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTEC" edc:desc="Transmitted OUT Data Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UNDERFIEC" edc:desc="Underflow Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERREC" edc:desc="Pipe Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDEC" edc:desc="NAKed Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIEC" edc:desc="Overflow Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERREC" edc:desc="CRC Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIEC" edc:desc="Short Packet Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:desc="Number of Busy Banks Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:desc="FIFO Control Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAC" edc:desc="Pipe Interrupts Disable HDMA Request Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZEC" edc:desc="Pipe Freeze Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40038648" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x40038650" edc:access="-----------------------nnnnnnnnn" edc:cname="USBHS_HSTPIPINRQ0" edc:impl="0x1FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="INRQ" edc:desc="IN Request Number before Freeze" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:desc="IN Request Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038654" edc:access="-----------------------nnnnnnnnn" edc:cname="USBHS_HSTPIPINRQ1" edc:impl="0x1FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="INRQ" edc:desc="IN Request Number before Freeze" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:desc="IN Request Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038658" edc:access="-----------------------nnnnnnnnn" edc:cname="USBHS_HSTPIPINRQ2" edc:impl="0x1FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="INRQ" edc:desc="IN Request Number before Freeze" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:desc="IN Request Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003865C" edc:access="-----------------------nnnnnnnnn" edc:cname="USBHS_HSTPIPINRQ3" edc:impl="0x1FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="INRQ" edc:desc="IN Request Number before Freeze" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:desc="IN Request Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038660" edc:access="-----------------------nnnnnnnnn" edc:cname="USBHS_HSTPIPINRQ4" edc:impl="0x1FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="INRQ" edc:desc="IN Request Number before Freeze" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:desc="IN Request Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038664" edc:access="-----------------------nnnnnnnnn" edc:cname="USBHS_HSTPIPINRQ5" edc:impl="0x1FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="INRQ" edc:desc="IN Request Number before Freeze" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:desc="IN Request Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038668" edc:access="-----------------------nnnnnnnnn" edc:cname="USBHS_HSTPIPINRQ6" edc:impl="0x1FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="INRQ" edc:desc="IN Request Number before Freeze" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:desc="IN Request Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003866C" edc:access="-----------------------nnnnnnnnn" edc:cname="USBHS_HSTPIPINRQ7" edc:impl="0x1FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="INRQ" edc:desc="IN Request Number before Freeze" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:desc="IN Request Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038670" edc:access="-----------------------nnnnnnnnn" edc:cname="USBHS_HSTPIPINRQ8" edc:impl="0x1FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="INRQ" edc:desc="IN Request Number before Freeze" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:desc="IN Request Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40038674" edc:access="-----------------------nnnnnnnnn" edc:cname="USBHS_HSTPIPINRQ9" edc:impl="0x1FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="INRQ" edc:desc="IN Request Number before Freeze" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:desc="IN Request Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40038678" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x40038680" edc:access="-------------------------nnnnnnn" edc:cname="USBHS_HSTPIPERR0" edc:impl="0x7F" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DATATGL" edc:desc="Data Toggle Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAPID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID" edc:desc="Data PID Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Time-Out Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRC16" edc:desc="CRC16 Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COUNTER" edc:desc="Error Counter" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
