Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.4.74/samv71b/edc/ATSAMV71Q20B.PIC
      <edc:SFRDef edc:_addr="0x4005015C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_BCFR" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="BFRX" edc:desc="Broadcast Frames Received without Error" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050160" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_MFR" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="MFRX" edc:desc="Multicast Frames Received without Error" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050164" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="GMAC_PFR" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="PFRX" edc:desc="Pause Frames Received Register" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050168" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_BFR64" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="NFRX" edc:desc="64 Byte Frames Received without Error" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005016C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_TBFR127" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="NFRX" edc:desc="65 to 127 Byte Frames Received without Error" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050170" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_TBFR255" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="NFRX" edc:desc="128 to 255 Byte Frames Received without Error" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050174" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_TBFR511" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="NFRX" edc:desc="256 to 511 Byte Frames Received without Error" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050178" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_TBFR1023" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="NFRX" edc:desc="512 to 1023 Byte Frames Received without Error" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005017C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_TBFR1518" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="NFRX" edc:desc="1024 to 1518 Byte Frames Received without Error" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050180" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_TMXBFR" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="NFRX" edc:desc="1519 to Maximum Byte Frames Received without Error" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050184" edc:access="----------------------rrrrrrrrrr" edc:cname="GMAC_UFR" edc:impl="0x3FF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="UFRX" edc:desc="Undersize Frames Received" edc:nzwidth="0xA"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050188" edc:access="----------------------rrrrrrrrrr" edc:cname="GMAC_OFR" edc:impl="0x3FF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="OFRX" edc:desc="Oversized Frames Received" edc:nzwidth="0xA"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005018C" edc:access="----------------------rrrrrrrrrr" edc:cname="GMAC_JR" edc:impl="0x3FF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="JRX" edc:desc="Jabbers Received" edc:nzwidth="0xA"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050190" edc:access="----------------------rrrrrrrrrr" edc:cname="GMAC_FCSE" edc:impl="0x3FF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="FCKR" edc:desc="Frame Check Sequence Errors" edc:nzwidth="0xA"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050194" edc:access="----------------------rrrrrrrrrr" edc:cname="GMAC_LFFE" edc:impl="0x3FF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="LFER" edc:desc="Length Field Frame Errors" edc:nzwidth="0xA"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050198" edc:access="----------------------rrrrrrrrrr" edc:cname="GMAC_RSE" edc:impl="0x3FF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RXSE" edc:desc="Receive Symbol Errors" edc:nzwidth="0xA"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005019C" edc:access="----------------------rrrrrrrrrr" edc:cname="GMAC_AE" edc:impl="0x3FF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="AER" edc:desc="Alignment Errors" edc:nzwidth="0xA"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501A0" edc:access="--------------rrrrrrrrrrrrrrrrrr" edc:cname="GMAC_RRE" edc:impl="0x3FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RXRER" edc:desc="Receive Resource Errors" edc:nzwidth="0x12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501A4" edc:access="----------------------rrrrrrrrrr" edc:cname="GMAC_ROE" edc:impl="0x3FF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RXOVR" edc:desc="Receive Overruns" edc:nzwidth="0xA"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501A8" edc:access="------------------------rrrrrrrr" edc:cname="GMAC_IHCE" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="HCKER" edc:desc="IP Header Checksum Errors" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501AC" edc:access="------------------------rrrrrrrr" edc:cname="GMAC_TCE" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="TCKER" edc:desc="TCP Checksum Errors" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501B0" edc:access="------------------------rrrrrrrr" edc:cname="GMAC_UCE" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="UCKER" edc:desc="UDP Checksum Errors" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400501B4" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x400501BC" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="GMAC_TISUBN" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="LSBTIR" edc:desc="Lower Significant Bits of Timer Increment Register" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501C0" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="GMAC_TSH" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="TCS" edc:desc="Timer Count in Seconds" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400501C4" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x400501D0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_TSL" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="TCS" edc:desc="Timer Count in Seconds" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501D4" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_TN" edc:impl="0x3FFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="TNS" edc:desc="Timer Count in Nanoseconds" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501D8" edc:access="w-wwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="GMAC_TA" edc:impl="0xBFFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="ITDT" edc:desc="Increment/Decrement" edc:nzwidth="0x1E"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ADJ" edc:desc="Adjust 1588 Timer" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501DC" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GMAC_TI" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="CNS" edc:desc="Count Nanoseconds" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="ACNS" edc:desc="Alternative Count Nanoseconds" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="NIT" edc:desc="Number of Increments" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501E0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_EFTSL" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RUD" edc:desc="Register Update" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501E4" edc:access="--rrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_EFTN" edc:impl="0x3FFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RUD" edc:desc="Register Update" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501E8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_EFRSL" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RUD" edc:desc="Register Update" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501EC" edc:access="--rrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_EFRN" edc:impl="0x3FFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RUD" edc:desc="Register Update" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501F0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_PEFTSL" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RUD" edc:desc="Register Update" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501F4" edc:access="--rrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_PEFTN" edc:impl="0x3FFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RUD" edc:desc="Register Update" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501F8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_PEFRSL" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RUD" edc:desc="Register Update" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400501FC" edc:access="--rrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_PEFRN" edc:impl="0x3FFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="RUD" edc:desc="Register Update" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40050200" edc:offset="0x70"/>
      <edc:SFRDef edc:_addr="0x40050270" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="GMAC_RXLPI" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="COUNT" edc:desc="Count of RX LPI transitions (cleared on read)" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40050274" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GMAC_RXLPITIME" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="GMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GMAC">
            <edc:SFRFieldDef edc:cname="LPITIME" edc:desc="Time in LPI (cleared on read)" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
