Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.4.74/samv71b/edc/ATSAMV71Q20B.PIC
      <edc:SFRDef edc:_addr="0x4008002C" edc:access="--nn---n---nnnnn---n---n--nn--nn" edc:cname="SMC_CS_NUMBER2SMC_MODE" edc:impl="0x311F1133" edc:nzwidth="0x20" ltx:memberofperipheral="SMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SMC">
            <edc:SFRFieldDef edc:cname="READ_MODE" edc:desc="Read Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WRITE_MODE" edc:desc="Write Mode" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EXNW_MODE" edc:desc="NWAIT Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Disabled-The NWAIT input signal is ignored on the corresponding chip select." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FROZEN" edc:desc="Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="READY" edc:desc="Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BAT" edc:desc="Byte Access Type" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="BYTE_SELECT" edc:desc="Byte select access type:- Write operation is controlled using NCS, NWE, NBS0, NBS1.- Read operation is controlled using NCS, NRD, NBS0, NBS1." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="BYTE_WRITE" edc:desc="Byte write access type:- Write operation is controlled using NCS, NWR0, NWR1.- Read operation is controlled using NCS and NRD." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DBW" edc:desc="Data Bus Width" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="_8_BIT" edc:desc="8-bit Data Bus" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="_16_BIT" edc:desc="16-bit Data Bus" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TDF_CYCLES" edc:desc="Data Float Time" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="TDF_MODE" edc:desc="TDF Optimization" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PMEN" edc:desc="Page Mode Enabled" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PS" edc:desc="Page Size" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_4_BYTE" edc:desc="4-byte page" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_8_BYTE" edc:desc="8-byte page" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_16_BYTE" edc:desc="16-byte page" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_32_BYTE" edc:desc="32-byte page" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40080030" edc:access="--nnnnnn--nnnnnn--nnnnnn--nnnnnn" edc:cname="SMC_CS_NUMBER3SMC_SETUP" edc:impl="0x3F3F3F3F" edc:nzwidth="0x20" ltx:memberofperipheral="SMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SMC">
            <edc:SFRFieldDef edc:cname="NWE_SETUP" edc:desc="NWE Setup Length" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NCS_WR_SETUP" edc:desc="NCS Setup Length in WRITE Access" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NRD_SETUP" edc:desc="NRD Setup Length" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NCS_RD_SETUP" edc:desc="NCS Setup Length in READ Access" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40080034" edc:access="-nnnnnnn-nnnnnnn-nnnnnnn-nnnnnnn" edc:cname="SMC_CS_NUMBER3SMC_PULSE" edc:impl="0x7F7F7F7F" edc:nzwidth="0x20" ltx:memberofperipheral="SMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SMC">
            <edc:SFRFieldDef edc:cname="NWE_PULSE" edc:desc="NWE Pulse Length" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NCS_WR_PULSE" edc:desc="NCS Pulse Length in WRITE Access" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NRD_PULSE" edc:desc="NRD Pulse Length" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NCS_RD_PULSE" edc:desc="NCS Pulse Length in READ Access" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40080038" edc:access="-------nnnnnnnnn-------nnnnnnnnn" edc:cname="SMC_CS_NUMBER3SMC_CYCLE" edc:impl="0x1FF01FF" edc:nzwidth="0x20" ltx:memberofperipheral="SMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SMC">
            <edc:SFRFieldDef edc:cname="NWE_CYCLE" edc:desc="Total Write Cycle Length" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="NRD_CYCLE" edc:desc="Total Read Cycle Length" edc:nzwidth="0x9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4008003C" edc:access="--nn---n---nnnnn---n---n--nn--nn" edc:cname="SMC_CS_NUMBER3SMC_MODE" edc:impl="0x311F1133" edc:nzwidth="0x20" ltx:memberofperipheral="SMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SMC">
            <edc:SFRFieldDef edc:cname="READ_MODE" edc:desc="Read Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WRITE_MODE" edc:desc="Write Mode" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EXNW_MODE" edc:desc="NWAIT Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Disabled-The NWAIT input signal is ignored on the corresponding chip select." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FROZEN" edc:desc="Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="READY" edc:desc="Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BAT" edc:desc="Byte Access Type" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="BYTE_SELECT" edc:desc="Byte select access type:- Write operation is controlled using NCS, NWE, NBS0, NBS1.- Read operation is controlled using NCS, NRD, NBS0, NBS1." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="BYTE_WRITE" edc:desc="Byte write access type:- Write operation is controlled using NCS, NWR0, NWR1.- Read operation is controlled using NCS and NRD." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DBW" edc:desc="Data Bus Width" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="_8_BIT" edc:desc="8-bit Data Bus" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="_16_BIT" edc:desc="16-bit Data Bus" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TDF_CYCLES" edc:desc="Data Float Time" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="TDF_MODE" edc:desc="TDF Optimization" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PMEN" edc:desc="Page Mode Enabled" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PS" edc:desc="Page Size" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_4_BYTE" edc:desc="4-byte page" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_8_BYTE" edc:desc="8-byte page" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_16_BYTE" edc:desc="16-byte page" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_32_BYTE" edc:desc="32-byte page" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40080040" edc:offset="0x40"/>
      <edc:SFRDef edc:_addr="0x40080080" edc:access="--------------------nnnn-------n" edc:cname="SMC_OCMS" edc:impl="0xF01" edc:nzwidth="0x20" ltx:memberofperipheral="SMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SMC">
            <edc:SFRFieldDef edc:cname="SMSE" edc:desc="Static Memory Controller Scrambling Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="CS0SE" edc:desc="Chip Select (x = 0 to 3) Scrambling Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CS1SE" edc:desc="Chip Select (x = 0 to 3) Scrambling Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CS2SE" edc:desc="Chip Select (x = 0 to 3) Scrambling Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CS3SE" edc:desc="Chip Select (x = 0 to 3) Scrambling Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40080084" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="SMC_KEY1" edc:nzwidth="0x20" ltx:memberofperipheral="SMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SMC">
            <edc:SFRFieldDef edc:cname="KEY1" edc:desc="Off-Chip Memory Scrambling (OCMS) Key Part 1" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40080088" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="SMC_KEY2" edc:nzwidth="0x20" ltx:memberofperipheral="SMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SMC">
            <edc:SFRFieldDef edc:cname="KEY2" edc:desc="Off-Chip Memory Scrambling (OCMS) Key Part 2" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
